Repository: tuxedocomputers/tuxedo-tomte
Catalog: po/*.po
Languages: de_de

source: This OS version is not supported
de_de: Diese Version des Betriebssystems wird nicht unterstützt

source: This version {version} of {distribution} is not supported.
de_de: Die Version {version} von {distribution} wird nicht unterstützt.

source: Tomte will try again in a few minutes or after reboot or when activated manually with: sudo tomte configure all
de_de: Tomte wird in wenigen Minuten erneut versuchen oder nach einem Neustart oder bei manueller Aktivierung mit: sudo tomte configure all.

source: TUXEDO Tomte is installing fixes
de_de: TUXEDO Tomte installiert Fixes.

source: Please do not restart or shutdown the system.
de_de: Bitte führen Sie keinen Neustart des Systems durch und fahren Sie es nicht herunter.

source: Restart required
de_de: Neustart erforderlich

source: Please restart the system for the changes to take effect. Tomte could not install all the fixes and will try again the next time it is activated
de_de: Bitte starten Sie das System neu, damit die Änderungen wirksam werden. Tomte konnte nicht alle Fixes installieren und wird es beim nächsten Aktivieren erneut versuchen.

source: Tomte could not install all the fixes and will try again the next time it is activated
de_de: Tomte konnte nicht alle Fixes installieren und wird es beim nächsten Aktivieren erneut versuchen.

source: Please restart the system for the changes to take effect.
de_de: Bitte starten Sie das System neu, damit die Änderungen wirksam werden.

source: TUXEDO Tomte finished
de_de: TUXEDO Tomte fertig

source: TUXEDO Tomte finished applying all the required fixes available for this system.
de_de: TUXEDO Tomte hat alle erforderlichen Fixes für dieses System erfolgreich angewendet.

# HELP_tuxedo-tomte
source: tuxedo-tomte <COMMAND> [NAME...]
de_de: tuxedo-tomte <BEFEHL> [NAME...]

# HELP_tomte
source: tomte <COMMAND> [NAME...]
de_de: tomte <BEFEHL> [NAME...]

# HELP_list
source: list List all installable modules with detailed status
de_de: list Zeigt alle installierbaren Module mit detailliertem Status

# HELP_status
source: status Same as 'list'
de_de: status Gleich wie 'list'

# HELP_versions
source: versions Like 'list' but with version numbers
de_de: versions Wie 'list', aber mit Versionsnummern

# HELP_modules
source: modules List all available modules
de_de: modules Zeigt alle verfügbaren Module an

# HELP_description_MODULE
source: description MODULE Shows the module description
de_de: description MODULE Zeigt die Modulbeschreibung an

# HELP_configure_MODULE
source: configure MODULE ...|all Configure an unconfigured module
de_de: configure MODULE ...|all Konfiguriert ein noch nicht konfiguriertes Modul

# HELP_reconfigure_MODULE
source: reconfigure MODULE...|all Reconfigure a configured module
de_de: reconfigure MODULE...|all Rekonfiguriert ein bereits konfiguriertes Modul

# HELP_remove_MODULE
source: remove MODULE Remove a module from the system
de_de: remove MODULE Entfernt ein Modul aus dem System

# HELP_block_MODULE
source: block MODULE ...|all Blocks one or all modules
de_de: block MODULE ...|all Blockiert ein oder alle Module

# HELP_unblock_MODULE
source: unblock MODULE ... |all Unblocks one or all modules
de_de: unblock MODULE ... |all Entblockiert ein oder alle Module

# HELP_AUTOMATIC
source: AUTOMATIC Activates automatic configuration
de_de: AUTOMATIC Aktiviert automatische Konfiguration

# HELP_UPDATES_ONLY
source: UPDATES_ONLY Only updates will be installed automatically
de_de: UPDATES_ONLY Nur Updates werden automatisch installiert

# HELP_DONT_CONFIGURE
source: DONT_CONFIGURE Stops all automatic configuration
de_de: DONT_CONFIGURE Stoppt alle automatischen Konfigurationen

# HELP_loglevel
source: loglevel [NUM] Modifies or prints the used loglevel (0-2)
de_de: loglevel [NUM] Setzt oder zeigt den momentan verwendeten Loglevel (0-2)

# HELP_help
source: help Prints this message
de_de: help Zeigt diese Nachricht an

# HELP_footer
source: more details can be found in the man page
de_de: Weitere Details finden Sie in der Manpage

# updateGrub_description
source: reconfigures grub according to grub file
de_de: konfiguriert Grub gemäß der Grub-Datei neu

# updateInitramfs_description
source: updates initramfs
de_de: aktualisiert initramfs

# nobootonbattery_description
source: Fix for no-boot-on-battery on BA15
de_de: Fix für Kein-Boot-im-Batteriebetrieb auf BA15

# amdxhcihcdusbquirksuspendfix_description
source: Fix for some AMD devices where the xhci_hcd driver causes a jump out of suspend immediately on entering suspend
de_de: Fix für einige AMD-Geräte, bei denen der xhci_hcd-Treiber einen sofortigen Ausstieg aus dem Ruhezustand verursacht, wenn er in den Ruhezustand versetzt wird

# amdgpuwithnvidiafix_description
source: Enables activation of discrete NVIDIA graphics on devices with built-in AMD graphics. Also enables switching between both with prime-select
de_de: Ermöglicht die Aktivierung der dedizierten NVIDIA-Grafik auf Geräten mit integrierter AMD-Grafik. Ermöglicht auch das Umschalten zwischen beiden mit prime-select

# tuxedocontrolcenter_description
source: TUXEDO Control Center Application
de_de: TUXEDO Control Center-Anwendung

# tuxedokeyboard_description
source: Keyboard & keyboard backlight driver for TUXEDO notebooks
de_de: Treiber für Tastatur & Tastaturbeleuchtung für TUXEDO-Notebooks

# backlightfix_description
source: Fixes backlight issues for DX1708, GTX1060 with AUO Model 12701 and 21229 displays
de_de: Behebt Hintergrundbeleuchtungsprobleme für DX1708, GTX1060 mit AUO-Modell 12701 und 21229-Displays

# tuxedorepos_description
source: Prerequisite! Adds the TUXEDO repositories
de_de: Voraussetzung! Fügt die TUXEDO-Repositories hinzu

# tuxedomirrors_description
source: Adds TUXEDO maintained Ubuntu repositories
de_de: Fügt von TUXEDO gewartete Ubuntu-Repositories hinzu

# corefix_description
source: ACPI mod for accurate cores recognition
de_de: ACPI-Mod für eine genaue Erkennung der Kerne

# huaweime936fix_description
source: Configuration needed to operate Huawei-ME936
de_de: Konfiguration erforderlich für den Betrieb von Huawei-ME936

# huaweime906sfix_description
source: Configuration needed to operate Huawei-ME906s
de_de: Konfiguration erforderlich für den Betrieb von Huawei-ME906s

# huaweime906shpfix_description
source: Configuration needed to operate Huawei-ME906s HP rebranded
de_de: Konfiguration erforderlich für den Betrieb von Huawei-ME906s HP rebranded

# elantechtouchpadfix_description
source: Fixes non working Elantech touchpad
de_de: Behebt das Problem, dass das Elantech-Touchpad nicht funktioniert

# tuxedotouchpadswitch_description
source: Adds hardware enable/disable for touchpads with LED indicator on several TUXEDO notebooks
de_de: Fügt die Hardwareaktivierung/deaktivierung für Touchpads mit LED-Anzeige auf verschiedenen TUXEDO-Notebooks hinzu

# tuxedonvmefix_description
source: Removes sleep bug on Kingston A2000 NVME devices by updating the firmware
de_de: Entfernt den Sleep-Bug auf Kingston A2000 NVME-Geräten durch ein Firmware-Update

# tuxedokeyboardite_description
source: Keyboard back-light driver for ITE devices
de_de: Treiber für die Tastaturbeleuchtung für ITE-Geräte

# fingerprintreader_description
source: Packages needed for fingerprint reader to work on certain TUXEDO notebooks
de_de: Pakete, die für den Betrieb des Fingerabdrucklesers auf bestimmten TUXEDO-Notebooks benötigt werden

# tuxedorestoreaudiofix_description
source: Systemd service which rescans for missing audio devices
de_de: Systemd-Dienst, der nach fehlenden Audiogeräten sucht

# kerneltuxedo2004_description
source: Selects, installs and cleans up TUXEDO Linux kernels
de_de: Auswahl, Installation und Bereinigung von TUXEDO-Linux-Kernels

# kerneltuxedo2204_description
source: Selects, installs and cleans up TUXEDO Linux kernels
de_de: Auswahl, Installation und Bereinigung von TUXEDO-Linux-Kernels

# kerneltuxedo2204edge_description
source: Selects, installs and cleans up TUXEDO Linux kernels
de_de: Auswahl, Installation und Bereinigung von TUXEDO-Linux-Kernels

# kerneltuxedo2404_description
source: Selects, installs and cleans up TUXEDO Linux kernels
de_de: Auswahl, Installation und Bereinigung von TUXEDO-Linux-Kernels

# nvidiadriver_description
source: Required Nvidia drivers
de_de: Erforderliche Nvidia-Treiber

# amdgpudisablepsr_description
source: Disables Panel Self Refresh (PSR)
de_de: Deaktiviert PSR aus

# r8168dkms_description
source: Linux device driver for several Realtek Ethernet controllers
de_de: Linux-Gerätetreiber für mehrere Realtek-Ethernet-Controller

# apportfix_description
source: Workaround for undefined problems with apport
de_de: Workaround für undefinierte Probleme mit Apport

# amdgpubacklightauxoff_description
source: Fixes backlight control
de_de: Behebt die Hintergrundbeleuchtungssteuerung

# i915enablepsrfix_description
source: Provides better battery life
de_de: Bietet eine bessere Akkulaufzeit

# thunderboltbootdelayfix_description
source: Solves kernel takes too long at loading thundebolt module at boot
de_de: Löst das Problem, dass der Kernel beim Laden des Thunderbolt-Moduls beim Booten zu lange dauert

# lightdmlogindcheckgraphicalfix_description
source: Fixes lightdm starting before windowmanager
de_de: Behebt das Problem, dass lightdm vor dem Windowmanager gestartet wird

# nvidiabacklightcontrolfix_description
source: Fixes backlight control for Nvidia GPUs
de_de: Behebt die Hintergrundbeleuchtungssteuerung für Nvidia-GPUs

# earlyloadbacklightcontrolfix_description
source: For backlight control working with Nvidia, the i915 needs to be loaded earlier
de_de: Für eine funktionierende Hintergrundbeleuchtungssteuerung mit Nvidia muss der i915 früher geladen werden

# tuxedor8125dkms_description
source: Newest driver for RTL8125 2.5GbE Controller, fixes ethernet bug
de_de: Neuster Treiber für RTL8125 2.5GbE-Controller, behebt Ethernet-Bug

# cardreaderfix_description
source: udev rule which inhibits power idle state for cardreader RTS522A
de_de: udev-Regel, die den Stromsparzustand für den Kartenleser RTS522A unterbindet

# samsungnvmefix_description
source: fix for Samsung NVMe wake up from sleep
de_de: Fix für das Aufwachen von Samsung NVMe aus dem Ruhezustand

# intelgenXIIIpowerctlfix_description
source: sets power control to 'auto' on PCI USB controller on Intel Gen13 devices
de_de: setzt die Stromsteuerung auf 'auto' am PCI-USB-Controller auf Intel Gen13-Geräten

# tuxedodgpurun_description
source: commandline tool and KDE context menu entries to run programms on dGPU while in on-demand mode
de_de: Befehlszeilentool und KDE-Kontextmenüeinträge zum Ausführen von Programmen auf der dGPU im On-Demand-Modus

# acpibacklightvideofix_description
source: Fixes boot delays/freezes in Nvidia modes
de_de: Behebt Bootverzögerungen/Einfrierungen im Nvidia-Modus

# disablegucfix_description
source: Disables GuC and HuC load for Intel iGPU driver (i915)
de_de: Deaktiviert laden des GuC und HuC auf Intel iGPU (i915)

# tuxedodrivers_description
source: Drivers for several platform devices for TUXEDO notebooks
de_de: Treiber für mehrere Plattformgeräte für TUXEDO-Notebooks

# systemdbacklightfix_description
source: Makes systemd-backlight catch all keyboard backlight devices
de_de: Damit systemd-backlight alle Tastaturen mit Hintergrundbeleuchtung findet

# elementaryosdkmspinningfix_description
source: Pinning to ensure the TUXEDO packages get priority at installation and upgrade
de_de: Pinning damit Pakete von TUXEDO bevorzugt installiert werden

# ath12kstandbyfix_description
source: Loads and unloads the ath12k wifi kernel module to enable standby.
de_de: Lädt und entlädt das ath12k WLAN Kernel-Modul, um den Standby-Modus zu ermöglichen.

# nvmequirkswitchtodeepsleepfix_description
source: Chooses a different standby mode to save power (triggered by built-in NVMe model)
de_de: Wählt einen anderen Standby-Modus, um Strom zu sparen (ausgelöst durch das integrierte NVMe-Modell)

# tuxedoplasmaupgrade_description
source: Application to upgrade the system to Plasma 6
de_de: Anwendung die Plasma 6 installiert

# tuxedoyt6801_description
source: Driver for Motorcomm YT6801 Ethernet controller
de_de: Treiber für Motorcomm YT6801 Netzwerkcontroller

# textboot_description
source: Activates booting into text mode
de_de: Aktiviert den Systemstart in den Textmodus

# tuxedowifisetregdomain_description
source: Installation of tuxedo-wifi-set-reg-domain, if useful for Wi-Fi
de_de: Installation von tuxedo-wifi-set-reg-domain, falls sinnvoll für das WLAN-Modul

# gfxmode_description
source: Sets grub into best resolution
de_de: Setzt das grub-Menue auf die richtige Aufleosung

# noecwakeupfix_description
source: Prevents spurious wake-up from suspend triggered by the EC
de_de: Verhindert vom EC getriggertes unerwünschtes Erwachen aus Suspend

# tuxedobtoffsuspend_description
source: Workaround for broken Bluetooth suspend issues. Effectively turns off Bluetooth before suspend and restores it after resume
de_de: Workaround für Probleme mit Bluetooth im Ruhezustand. Schaltet Bluetooth vor den Ruhezustand aus und schaltet es danach wieder ein
